<a href="https://colab.research.google.com/github/alrb2005/MechaineLearing-0716-/blob/master/titanic_80.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [19]:

!mkdir -p ~/.kaggle
!cp kaggle.json ~/.kaggle/

In [20]:
!kaggle competitions download -c titanic

Warning: Your Kaggle API key is readable by other users on this system! To fix this, you can run 'chmod 600 /root/.kaggle/kaggle.json'
Warning: Looks like you're using an outdated API Version, please consider updating (server 1.5.6 / client 1.5.4)
gender_submission.csv: Skipping, found more recently modified local copy (use --force to force download)
train.csv: Skipping, found more recently modified local copy (use --force to force download)
test.csv: Skipping, found more recently modified local copy (use --force to force download)

In [21]:
import pandas as pd
train_df = pd.read_csv("train.csv", encoding="utf-8")
test_df = pd.read_csv("test.csv", encoding="utf-8")

In [22]:
datas = pd.concat([train_df, test_df])
datas = datas.drop(["PassengerId", "Survived"], axis = 1)
datas

     Pclass                                               Name  ... Cabin  Embarked
0         3                            Braund, Mr. Owen Harris  ...   NaN         S
1         1  Cumings, Mrs. John Bradley (Florence Briggs Th...  ...   C85         C
2         3                             Heikkinen, Miss. Laina  ...   NaN         S
3         1       Futrelle, Mrs. Jacques Heath (Lily May Peel)  ...  C123         S
4         3                           Allen, Mr. William Henry  ...   NaN         S
..      ...                                                ...  ...   ...       ...
413       3                                 Spector, Mr. Woolf  ...   NaN         S
414       1                       Oliva y Ocana, Dona. Fermina  ...  C105         C
415       3                       Saether, Mr. Simon Sivertsen  ...   NaN         S
416       3                                Ware, Mr. Frederick  ...   NaN         S
417       3                           Peter, Master. Michael J  ...   NaN         C

[1309 rows x 10 columns]

In [23]:
# Step1. 補缺失值
s = datas.isna().sum()
# 篩選 series[[True....]]
s[s > 0]

Age          263
Fare           1
Cabin       1014
Embarked       2
dtype: int64

In [24]:
most = datas["Embarked"].value_counts().idxmax()
datas["Embarked"] = datas["Embarked"].fillna(most)

In [25]:
# 補數字類型
med = datas.median().drop(["Pclass"])
datas = datas.fillna(med)
datas.isna().sum()

Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Cabin       1014
Embarked       0
dtype: int64

In [26]:
#step2. One-Hot(類別做這個)
#沒有大小關係的必做 one-Hot
#雖然Pclass屬於類型，而在補值的時候也是填上最多的，Pclass是有大小關係的

# 先準備一下我要保留的list
def name(n):
    n = n.split(",")[-1].split(".")[0]
    return n.strip()
v = datas["Name"].apply(name).value_counts()
white = v.index[:4]

In [27]:
def name(n): 
    n = n.split(",")[-1].split(".")[0]
    n = n.strip()
    if n in white:
        return n
    else:
        return None
datas["Name"] = datas["Name"].apply(name)
datas

     Pclass    Name     Sex   Age  ...              Ticket      Fare Cabin  Embarked
0         3      Mr    male  22.0  ...           A/5 21171    7.2500   NaN         S
1         1     Mrs  female  38.0  ...            PC 17599   71.2833   C85         C
2         3    Miss  female  26.0  ...    STON/O2. 3101282    7.9250   NaN         S
3         1     Mrs  female  35.0  ...              113803   53.1000  C123         S
4         3      Mr    male  35.0  ...              373450    8.0500   NaN         S
..      ...     ...     ...   ...  ...                 ...       ...   ...       ...
413       3      Mr    male  28.0  ...           A.5. 3236    8.0500   NaN         S
414       1    None  female  39.0  ...            PC 17758  108.9000  C105         C
415       3      Mr    male  38.5  ...  SOTON/O.Q. 3101262    7.2500   NaN         S
416       3      Mr    male  28.0  ...              359309    8.0500   NaN         S
417       3  Master    male  28.0  ...                2668   22.3583   NaN         C

[1309 rows x 10 columns]

In [28]:
v = datas["Ticket"].value_counts()
def ticket(t):
  global v
  return v[t]
datas["Ticket"] = datas["Ticket"].apply(ticket)

In [29]:
datas = datas.drop(["Cabin"], axis=1)

In [30]:
# 如果你想要重製index: datas.reset_index(drop=True)
datas

     Pclass    Name     Sex   Age  SibSp  Parch  Ticket      Fare Embarked
0         3      Mr    male  22.0      1      0       1    7.2500        S
1         1     Mrs  female  38.0      1      0       2   71.2833        C
2         3    Miss  female  26.0      0      0       1    7.9250        S
3         1     Mrs  female  35.0      1      0       2   53.1000        S
4         3      Mr    male  35.0      0      0       1    8.0500        S
..      ...     ...     ...   ...    ...    ...     ...       ...      ...
413       3      Mr    male  28.0      0      0       1    8.0500        S
414       1    None  female  39.0      0      0       3  108.9000        C
415       3      Mr    male  38.5      0      0       1    7.2500        S
416       3      Mr    male  28.0      0      0       1    8.0500        S
417       3  Master    male  28.0      1      1       3   22.3583        C

[1309 rows x 9 columns]

In [31]:
datas = pd.get_dummies(datas)
datas

     Pclass   Age  SibSp  Parch  ...  Sex_male  Embarked_C  Embarked_Q  Embarked_S
0         3  22.0      1      0  ...         1           0           0           1
1         1  38.0      1      0  ...         0           1           0           0
2         3  26.0      0      0  ...         0           0           0           1
3         1  35.0      1      0  ...         0           0           0           1
4         3  35.0      0      0  ...         1           0           0           1
..      ...   ...    ...    ...  ...       ...         ...         ...         ...
413       3  28.0      0      0  ...         1           0           0           1
414       1  39.0      0      0  ...         0           1           0           0
415       3  38.5      0      0  ...         1           0           0           1
416       3  28.0      0      0  ...         1           0           0           1
417       3  28.0      1      1  ...         1           1           0           0

[1309 rows x 15 columns]

In [32]:
# 取列: iloc(看實際是第幾列), loc(看列標籤)
# [第一列, 第二列....]
x_train = datas.iloc[:len(train_df)]
x_predict = datas.iloc[len(train_df):]
y_train = train_df["Survived"]

In [34]:
from sklearn.ensemble import RandomForestClassifier
from sklearn.model_selection import GridSearchCV
RandomForestClassifier(random_state=0)
params = {
    "n_estimators":range(20, 100),
    "max_depth":(5,10)
}
search = GridSearchCV(clf, params, cv=10, n_jobs=-1)
search.fit(x_train, y_train)
print(search.best_params_)
print(search.best_score_)

{'max_depth': 5, 'n_estimators': 29}
0.8350312109862671

In [35]:
from sklearn.ensemble import RandomForestClassifier
from sklearn.model_selection import cross_val_score
import numpy as np

clf = RandomForestClassifier(n_estimators=29, max_depth=5, random_state=0) 
scores = cross_val_score(clf, x_train, y_train, cv=10, n_jobs=-1)
print(scores)
print(np.average(scores))

[0.82222222 0.88764045 0.7752809  0.88764045 0.84269663 0.79775281
 0.82022472 0.78651685 0.87640449 0.85393258]
0.8350312109862671